[Challenges.Challenge_Aster_KillDragons:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 10 dragons"

[Challenges.Challenge_Aster_KillDragons:ChallengeConditionDefinition_10 ChallengeConditionDefinition]
Description="Kill 50 dragons"

[Challenges.Challenge_Aster_KillDragons:ChallengeConditionDefinition_11 ChallengeConditionDefinition]
Description="Kill 80 dragons"

[Challenges.Challenge_Aster_KillDragons:ChallengeConditionDefinition_12 ChallengeConditionDefinition]
Description="Kill 110 dragons"

[Challenges.Challenge_Aster_KillDragons:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 25 dragons"

[Challenges.Challenge_Aster_KillDwarves:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 100 dwarves"

[Challenges.Challenge_Aster_KillDwarves:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 50 dwarves"

[Challenges.Challenge_Aster_KillDwarves:ChallengeConditionDefinition_12 ChallengeConditionDefinition]
Description="Kill 250 dwarves"

[Challenges.Challenge_Aster_KillDwarves:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 150 dwarves"

[Challenges.Challenge_Aster_KillDwarves:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 200 dwarves"

[Challenges.Challenge_Aster_KillGolems:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 10 golems"

[Challenges.Challenge_Aster_KillGolems:ChallengeConditionDefinition_10 ChallengeConditionDefinition]
Description="Kill 50 golems"

[Challenges.Challenge_Aster_KillGolems:ChallengeConditionDefinition_11 ChallengeConditionDefinition]
Description="Kill 80 golems"

[Challenges.Challenge_Aster_KillGolems:ChallengeConditionDefinition_12 ChallengeConditionDefinition]
Description="Kill 120 golems"

[Challenges.Challenge_Aster_KillGolems:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 25 golems"

[Challenges.Challenge_Aster_KillKnights:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 10 knights"

[Challenges.Challenge_Aster_KillKnights:ChallengeConditionDefinition_10 ChallengeConditionDefinition]
Description="Kill 75 knights"

[Challenges.Challenge_Aster_KillKnights:ChallengeConditionDefinition_11 ChallengeConditionDefinition]
Description="Kill 120 knights"

[Challenges.Challenge_Aster_KillKnights:ChallengeConditionDefinition_12 ChallengeConditionDefinition]
Description="Kill 175 knights"

[Challenges.Challenge_Aster_KillKnights:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 25 knights"

[Challenges.Challenge_Aster_KillMimics:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 5 mimics"

[Challenges.Challenge_Aster_KillMimics:ChallengeConditionDefinition_10 ChallengeConditionDefinition]
Description="Kill 30 mimics"

[Challenges.Challenge_Aster_KillMimics:ChallengeConditionDefinition_11 ChallengeConditionDefinition]
Description="Kill 50 mimics"

[Challenges.Challenge_Aster_KillMimics:ChallengeConditionDefinition_12 ChallengeConditionDefinition]
Description="Kill 75 mimics"

[Challenges.Challenge_Aster_KillMimics:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 15 mimics"

[Challenges.Challenge_Aster_KillOrcs:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 50 orcs"

[Challenges.Challenge_Aster_KillOrcs:ChallengeConditionDefinition_10 ChallengeConditionDefinition]
Description="Kill 150 orcs"

[Challenges.Challenge_Aster_KillOrcs:ChallengeConditionDefinition_11 ChallengeConditionDefinition]
Description="Kill 200 orcs"

[Challenges.Challenge_Aster_KillOrcs:ChallengeConditionDefinition_12 ChallengeConditionDefinition]
Description="Kill 250 orcs"

[Challenges.Challenge_Aster_KillOrcs:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 100 orcs"

[Challenges.Challenge_Aster_KillSkeletons:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 50 skeletons"

[Challenges.Challenge_Aster_KillSkeletons:ChallengeConditionDefinition_10 ChallengeConditionDefinition]
Description="Kill 150 skeletons"

[Challenges.Challenge_Aster_KillSkeletons:ChallengeConditionDefinition_11 ChallengeConditionDefinition]
Description="Kill 200 skeletons"

[Challenges.Challenge_Aster_KillSkeletons:ChallengeConditionDefinition_12 ChallengeConditionDefinition]
Description="Kill 250 skeletons"

[Challenges.Challenge_Aster_KillSkeletons:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 100 skeletons"

[Challenges.Challenge_Aster_KillSpiders:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 25 spiders"

[Challenges.Challenge_Aster_KillSpiders:ChallengeConditionDefinition_10 ChallengeConditionDefinition]
Description="Kill 100 spiders"

[Challenges.Challenge_Aster_KillSpiders:ChallengeConditionDefinition_11 ChallengeConditionDefinition]
Description="Kill 150 spiders"

[Challenges.Challenge_Aster_KillSpiders:ChallengeConditionDefinition_12 ChallengeConditionDefinition]
Description="Kill 200 spiders"

[Challenges.Challenge_Aster_KillSpiders:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 50 spiders"

[Challenges.Challenge_Aster_KillTreants:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 10 treants"

[Challenges.Challenge_Aster_KillTreants:ChallengeConditionDefinition_10 ChallengeConditionDefinition]
Description="Kill 50 treants"

[Challenges.Challenge_Aster_KillTreants:ChallengeConditionDefinition_11 ChallengeConditionDefinition]
Description="Kill 80 treants"

[Challenges.Challenge_Aster_KillTreants:ChallengeConditionDefinition_12 ChallengeConditionDefinition]
Description="Kill 120 treants"

[Challenges.Challenge_Aster_KillTreants:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 25 treants"

[Challenges.Challenge_Aster_KillWizards:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 10 wizards"

[Challenges.Challenge_Aster_KillWizards:ChallengeConditionDefinition_10 ChallengeConditionDefinition]
Description="Kill 50 wizards"

[Challenges.Challenge_Aster_KillWizards:ChallengeConditionDefinition_11 ChallengeConditionDefinition]
Description="Kill 80 wizards"

[Challenges.Challenge_Aster_KillWizards:ChallengeConditionDefinition_12 ChallengeConditionDefinition]
Description="Kill 120 wizards"

[Challenges.Challenge_Aster_KillWizards:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 25 wizards"

[LevelChallenges.Dungeon_SpiderQueen ChallengeDefinition]
Description="Defeat the Spider Queen without letting her heal."

[LevelChallenges.TempleSlaughter_Orc ChallengeDefinition]
Description="Kill the King of Orcs in the badass round of Magic Slaughter."

[LevelChallenges.Village_SmashingPumpkins ChallengeDefinition]
Description="Crush 10 pumpkins."

[LevelChallenges.Mines_VaultRoy ChallengeDefinition]
Description="Find the 2 hidden Vault Symbols."